app/Controllers/Admin.php

SELECT *
FROM `user`
WHERE `id_user` = '3'
SELECT `company`.`name`, `company`.`address`, `company`.`city`, `company`.`cp`
FROM `user`
JOIN `user_has_company` ON `user_has_company`.`id_user` = `user`.`id_user`
JOIN `company` ON `user_has_company`.`id_company`=`company`.`id_company`
---
    public function superprofile()
    {
        helper(['form']);
        $db      = \Config\Database::connect();
        $builder = $db->table('user');
        $id = session()->get('id_user');

        $builder->where('id_user', $id);
        $query   = $builder->get();
        $user = $query->getResultArray();
        $user = $user[0]; // juste le premier

        /* compétences certificats*/
        $builder->select('certificate.name');
        $builder->join('user_has_certificate', 'user_has_certificate.id_user = user.id_user');
        $builder->join('certificate', 'user_has_certificate.id_certificate = certificate.id_certificate');

        $query = $builder->get();
        $certificates = $query->getResultArray();
        $skills = [];
        foreach ($certificates as $certificate) {
            $skills[] = $certificate['name'];
        }

        $builder->select('company.name, company.address,company.city ,company.cp');
        $builder->join('user_has_company', 'user_has_company.id_user = user.id_user');
        $builder->join('company', 'user_has_company.id_company=company.id_company');
        $query = $builder->get();