app/Controllers/DashBoard.php

SELECT *
FROM `user`
WHERE `type` = 3
OR `type` = 5
---
    public function privileges()
    {

        $title = "Liste des privilèges";
        $db      = \Config\Database::connect();
        $builder = $db->table('user');
        $type = 3;
        $typed = 5;
        $builder->where('type', $type);
        $builder->orWhere('type', $typed);
        $query   = $builder->get();

SELECT *
FROM `user`
JOIN `user_has_certificate` ON `user_has_certificate`.`id_user` = `user`.`id_user`
JOIN `certificate` ON `user_has_certificate`.`id_certificate` = `certificate`.`id_certificate`
WHERE `user`.`id_user` = '38'
---
            $builder->where('user.id_user', $listformers[$i]['id_user']);
            $builder->join('user_has_certificate', 'user_has_certificate.id_user = user.id_user');
            $builder->join('certificate', 'user_has_certificate.id_certificate = certificate.id_certificate');
            $query = $builder->get();