app/Controllers/DashBoard.php

    public function listformerpublishes()
    {

        $title = "Liste des publications";

        $db      = \Config\Database::connect();
        $builder = $db->table('user');

        $builder->select('publication.id_publication,publication.subject,publication.description,publication.datetime');

        $builder->where('user.id_user', '36');
        $builder->join('user_has_article', 'user_has_article.id_user = user.id_user');
        $builder->join('article', 'user_has_article.id_article = article.id_article');
        $builder->join('publication_has_article', 'publication_has_article.id_article = article.id_article');
        $builder->join('publication', 'publication_has_article.id_publication = publication.id_publication');
        $builder->groupBy('publication.id_publication');
        $query   = $builder->get();
---
SELECT `publication`.`id_publication`, `publication`.`subject`, `publication`.`description`, `publication`.`datetime`
FROM `user`
JOIN `user_has_article` ON `user_has_article`.`id_user` = `user`.`id_user`
JOIN `article` ON `user_has_article`.`id_article` = `article`.`id_article`
JOIN `publication_has_article` ON `publication_has_article`.`id_article` = `article`.`id_article`
JOIN `publication` ON `publication_has_article`.`id_publication` = `publication`.`id_publication`
WHERE `user`.`id_user` = '36'
GROUP BY `publication`.`id_publication`