app/Controllers/Former.php

            $builder->where('user.id_user', $listformers[$i]['id_user']);
            $builder->join('user_has_certificate', 'user_has_certificate.id_user = user.id_user');
            $builder->join('certificate', 'user_has_certificate.id_certificate = certificate.id_certificate');
            $query = $builder->get();
---
SELECT *
FROM `user`
JOIN `user_has_certificate` ON `user_has_certificate`.`id_user` = `user`.`id_user`
JOIN `certificate` ON `user_has_certificate`.`id_certificate` = `certificate`.`id_certificate`
WHERE `user`.`id_user` = '39'

    public function rdv()
    {
        $user = $this->user_model->getUserSession();
        $query = $this->rdv_model->where("id_user", $user['id_user'])->findAll();
---
SELECT *
FROM `rdv`
WHERE `id_user` = '41'