app/Controllers/Home.php

SELECT *
FROM `article`
WHERE `status` = 1
ORDER BY `datetime` DESC
 LIMIT 6
---
    public function index()
    {
        helper(['form']);

        $carousel_helper = new CarouselHelper();

        try {
            $db      = \Config\Database::connect();
            $builder = $db->table('article');

            $builder->where('status', '1');
            $builder->orderBy('datetime', 'DESC');
            $builder->limit(6);
            $query   = $builder->get();

SELECT *
FROM `article`
JOIN `user_has_article` ON `user_has_article`.`id_article` = `article`.`id_article`
JOIN `user` ON `user_has_article`.`id_user` = `user`.`id_user`
WHERE `article`.`id_article` = '60'
---
            $builder->where('article.id_article', $listarticles[$i]['id_article']);
            $builder->join('user_has_article', 'user_has_article.id_article = article.id_article');
            $builder->join('user', 'user_has_article.id_user = user.id_user');
            $query = $builder->get();