app/Controllers/Media.php

    public function list_videos_home()
    {
        $title = "Liste des vidéos";
        $db      = \Config\Database::connect();
        $builder = $db->table('media');
        $builder->where('status', '1');
        $builder->where('type', '1');
        $query   = $builder->get();
---
SELECT *
FROM `media`
WHERE `status` = '1'
AND `type` = '1'