app/Controllers/News.php

SELECT *
FROM `article`
WHERE `status` = '1'
SELECT `user`.`name`, `user`.`firstname`
FROM `article`
JOIN `user_has_article` ON `user_has_article`.`id_article` = `article`.`id_article`
JOIN `user` ON `user_has_article`.`id_user` = `user`.`id_user`
WHERE `article`.`id_article` = '40'
---
    public function list_articles_home()
    {
        $title = "Liste des articles";
        $db      = \Config\Database::connect();
        $builder = $db->table('article');
        $builder->where('status', '1');
        $query   = $builder->get();
        $articles = $query->getResultArray();
        $listarticles = [];

        foreach ($articles as $article) {
            $listarticles[] = [
                "id_article" => $article['id_article'],
                "subject" => $article['subject'],
                "description" => $article['description'],
                "datetime" => $article['datetime'],
            ];
        }
        /* auteur de l'article*/
        $builder->select('user.name,user.firstname');

        for ($i = 0; $i < count($listarticles); $i++) {
            $builder->where('article.id_article', $listarticles[$i]['id_article']);
            $builder->join('user_has_article', 'user_has_article.id_article = article.id_article');
            $builder->join('user', 'user_has_article.id_user = user.id_user');
            $query = $builder->get();