app/Controllers/Search.php

    public function resultdata()
    {
        helper(['form']);

        if ($this->request->getMethod() == 'post') {

            $research = $this->request->getVar('research');
            $db = \Config\Database::connect();
            $builder = $db->table('media');
            $builder->like('name', $research);
            $builder->orLike('author', $research);
            $builder->where('status', VALIDE);
            $query   = $builder->get();
---
SELECT *
FROM `media`
WHERE `name` LIKE '%c++%' ESCAPE '!'
OR  `author` LIKE '%c++%' ESCAPE '!'
AND `status` = 1