app/Controllers/User.php

            print_r($dataUpdate);
            die();

            $this->user_model->update(session()->id_user, $dataUpdate);
---
UPDATE `user` SET `mail` = 'sisi@lesite.fr', `password` = NULL, `image_url` = NULL, `address` = '32 rue des amandiers', `cp` = '13310', `city` = 'St Martin de Crau', `country` = 'France', `phone` = '0644561231', `gender` = '0', `birthday` = '1975-01-10'
WHERE `user`.`id_user` IN ('37')