app/Controllers/User.php

SELECT *
FROM `user`
WHERE `mail` = 'sisi@lesite.fr'
 LIMIT 1
---

                $user = null;
                try {
                    $user = $this->user_model->where('mail', $mail)->first();

INSERT INTO `user` (`name`, `firstname`, `address`, `city`, `cp`, `country`, `type`, `phone`, `mail`, `password`, `newsletters`) VALUES ('Garcia', 'Sarah', '3 rue des mimosas', 'St martin de crau', '13310', 'France', '8', '0666778899', 'xenatronics@lesite.fr', '$2y$10$a6Rex03cXCiqNdw2TFKAUeAQ2NvhrBgeiubmsHx/hg2oqPdffBfaO', 1)
INSERT INTO `company` (`name`, `address`, `city`, `cp`, `kbis`, `siret`) VALUES ('Garcia', '3 rue des mimosas', 'ST martin de crau', '13310', 'AEZAZAZAZAZAZAERE', '1111222222211111')
INSERT INTO `user_has_company` (`id_user`, `id_company`) VALUES (32, 7)
---
    private function saveCompany($data_user, $data_company, $kbis, $siret)
    {
        //table utilisateur
        $this->user_model->save($data_user);

        // table entreprise
        $data_company['siret'] = $siret;
        $data_company['kbis'] = $kbis;
        $this->company_model->save($data_company);

        // table jointure
        $id_user = $this->user_model->getInsertID();
        $id_company = $this->company_model->getInsertID();
        $data_jointure = [
            "id_user" => $id_user,
            "id_company" => $id_company,
        ];
        $this->user_has_company_model->save($data_jointure);

SELECT *
FROM `company`
WHERE `name` = 'Garcia'
AND `cp` = '13310'
AND `city` = 'ST martin de crau'
 LIMIT 1
---
    private function ifNotExistCompany($data_company)
    {
        // on part du principe une seule société par ville
        // une évolution future: vérifier l'adresse
        $company = $this->company_model->where("name", $data_company['name'])
            ->where("cp", $data_company['cp'])
            ->where("city", $data_company['city'])
            ->first();

SELECT *
FROM `user`
WHERE `id_user` = '37'
---
    public function profilecompany()
    {
        $id =  session()->get('id_user');

UPDATE `user` SET `name` = 'Poinsignon', `firstname` = 'Melanie', `address` = '4 rue Anotole France', `city` = 'Salon de  Provence', `cp` = '13300', `country` = 'France', `phone` = '0666778888', `mail` = 'm-poinsignon@lesite.fr', `birthday` = '', `gender` = '0'
WHERE `user`.`id_user` IN ('3')
---
                'birthday' => session()->birthday,
                'gender' => session()->gender,
            ];
            $this->user_model->update(session()->id_user, $updateData);