app/Models/ArticleModel.php

SELECT *
FROM `article`
WHERE `status` = 1
---
    function getFilterArticles($filter = VALIDE,  $limit = ALL, $orderby = NONE)
    {
        $builder = $this->db->table('article');
        if ($filter !== ALL) {
            $builder->where('status', $filter);
        }
        if ($limit !== ALL) {
            $builder->limit($limit);
        }
        if ($orderby !== NONE) {
            $builder->orderBy('datetime', $orderby);
        }

        $query   = $builder->get();

SELECT `user`.`name`, `user`.`firstname`
FROM `article`
JOIN `user_has_article` ON `user_has_article`.`id_article` = `article`.`id_article`
JOIN `user` ON `user_has_article`.`id_user` = `user`.`id_user`
WHERE `article`.`id_article` = '63'
---
    function getAuthorsArticles($list, $builder)
    {
        $builder->select('user.name,user.firstname');

        for ($i = 0; $i < count($list); $i++) {
            $builder->where('article.id_article', $list[$i]['id_article']);
            $builder->join('user_has_article', 'user_has_article.id_article = article.id_article');
            $builder->join('user', 'user_has_article.id_user = user.id_user');
            $query = $builder->get();