app/Models/MediaModel.php

    function ValidatedMedias($type)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('media');
        $builder->where('status', VALIDE);
        $builder->where('type', $type);
        $query   = $builder->get();
---
SELECT *
FROM `media`
WHERE `status` = 1
AND `type` = '2'