app/Models/PageModel.php

SELECT *
FROM `page`
WHERE `id_page` = '2'
---
    function getPageById($id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('page');
        $builder->where("id_page", $id);
        $query = $builder->get();