app/Models/TrainingModel.php

SELECT *
FROM `training`
WHERE `id_training` = '96'
---
    function getTrainingById($id)
    {
        //$db      = \Config\Database::connect();
        $builder = $this->db->table('training');
        $builder->where("id_training", $id);
        $query = $builder->get();

SELECT `id_training`, `title`
FROM `training`
---
    function getTrainingsTitle($status = ALL)
    {
        //$db      = \Config\Database::connect();
        $builder = $this->db->table('training');
        $builder->select("id_training, title");
        $query = $builder->get();

SELECT `id_training`, `title`, `date`, `description`, `image_url`
FROM `training`
---
    public function getFilterTrainings($status = ALL, $limit = -1)
    {
        //$db      = \Config\Database::connect();
        $builder = $this->db->table('training');
        $builder->select("id_training, title,date, description, image_url, status");
        if ($status != ALL) {
            $builder->where("status", $status);
        }
        if ($limit != -1) {
            $builder->limit($limit);
        }
        $query = $builder->get();

SELECT `page`.`id_page`, `page`.`title`, `page`.`content`, `page`.`image_url`, `page`.`video_url`
FROM `training_has_page`
JOIN `page` ON `page`.`id_page`=`training_has_page`.`id_page`
WHERE `training_has_page`.`id_training` = '123'
---
    public function getFilterPages($id_training, $limit = -1)
    {
        //$db      = \Config\Database::connect();
        $builder = $this->db->table('training_has_page');
        $builder->select("page.id_page, page.title, page.content, page.image_url,page.video_url");
        $builder->join('page', 'page.id_page=training_has_page.id_page');
        $builder->where("training_has_page.id_training", $id_training);

        if ($limit != -1) {
            $builder->limit($limit);
        }
        $query = $builder->get();