app/Models/UserModel.php

SELECT `certificate`.`name`
FROM `user`
JOIN `user_has_certificate` ON `user_has_certificate`.`id_user` = `user`.`id_user`
JOIN `certificate` ON `user_has_certificate`.`id_certificate` = `certificate`.`id_certificate`
WHERE `user`.`id_user` = '64'
---
    function getInfosCertificates($id)
    {
        $builder = $this->db->table('user');
        $builder->select('certificate.name');
        $builder->where('user.id_user', $id);
        $builder->join('user_has_certificate', 'user_has_certificate.id_user = user.id_user');
        $builder->join('certificate', 'user_has_certificate.id_certificate = certificate.id_certificate');
        $query = $builder->get();

SELECT `certificate`.*
FROM `user`
JOIN `user_has_certificate` ON `user_has_certificate`.`id_user` = `user`.`id_user`
JOIN `certificate` ON `user_has_certificate`.`id_certificate` = `certificate`.`id_certificate`
WHERE `user`.`id_user` = '64'
---
    function getCertificates($id)
    {
        $builder = $this->db->table('user');
        $builder->select('certificate.*');
        $builder->where('user.id_user', $id);
        $builder->join('user_has_certificate', 'user_has_certificate.id_user = user.id_user');
        $builder->join('certificate', 'user_has_certificate.id_certificate = certificate.id_certificate');
        $query = $builder->get();

SELECT `company`.`name`, `company`.`address`, `company`.`city`, `company`.`cp`
FROM `user`
JOIN `user_has_company` ON `user_has_company`.`id_user` = `user`.`id_user`
JOIN `company` ON `user_has_company`.`id_company`=`company`.`id_company`
WHERE `user`.`id_user` = '37'
---
    function getCompanyById($id)
    {
        $builder = $this->db->table('user');
        $builder->select('company.name, company.address, company.city ,company.cp');
        $builder->where('user.id_user', $id);
        $builder->join('user_has_company', 'user_has_company.id_user = user.id_user');
        $builder->join('company', 'user_has_company.id_company=company.id_company');
        $query = $builder->get();

SELECT `company`.`name`, `company`.`address`, `company`.`city`, `company`.`cp`
FROM `user`
JOIN `user_has_company` ON `user_has_company`.`id_user` = `user`.`id_user`
JOIN `company` ON `user_has_company`.`id_company`=`company`.`id_company`
WHERE `user`.`id_user` = '64'
---
    function getInfosCompany($id, $single = true)
    {
        $builder = $this->db->table('user');
        $builder->select('company.name, company.address, company.city ,company.cp');
        $builder->where('user.id_user', $id);
        $builder->join('user_has_company', 'user_has_company.id_user = user.id_user');
        $builder->join('company', 'user_has_company.id_company=company.id_company');
        $query = $builder->get();

SELECT *
FROM `user`
WHERE `type` = 7
---
    function getFormers()
    {
        $builder = $this->db->table('user');
        $builder->where('type', FORMER);
        $query   = $builder->get();

SELECT *
FROM `user`
WHERE `type` = 9
---
    function getUserbyType($type, $id = ALL)
    {
        $builder = $this->db->table('user');
        if ($id !== ALL) {
            $builder->where('id', $id);
        }
        $builder->where('type', $type);
        $query   = $builder->get();

SELECT *
FROM `user`
WHERE `mail` = 'm-poinsignon@lesite.fr'
---
    function getUserByMail($mail)
    {
        $builder = $this->db->table('user');
        $builder->where('mail', $mail);
        $query   = $builder->get();