app/Libraries/ArticleHelper.php

    function getFilterArticles($filter = VALIDE)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('article');
        if ($filter!=ALL){
            $builder->where('status', $filter);
        }
        $query   = $builder->get();
---
SELECT *
FROM `article`
WHERE `status` = 1