app/Libraries/CategoryHelper.php

    function getCategories(){  // On récupère toutes les catégories
        $db      = \Config\Database::connect();
        $builder = $db->table('category');

        $query   = $builder->get();
---
SELECT *
FROM `category`