app/Libraries/MediaHelper.php

    function getVideos()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('media');
        $builder->where('type', '1');
        $query   = $builder->get();
---
SELECT *
FROM `media`
WHERE `type` = '1'

    function getAuthorsMedias($list,$builder)
    {
        $builder->select('user.name,user.firstname');

        for ($i = 0; $i < count($list); $i++) {
            $builder->where('media.id_media', $list[$i]['id_media']);
            $builder->join('user_has_media', 'user_has_media.id_media = media.id_media');
            $builder->join('user', 'user_has_media.id_user = user.id_user');
            $query = $builder->get();
---
SELECT `user`.`name`, `user`.`firstname`
FROM `media`
JOIN `user_has_media` ON `user_has_media`.`id_media` = `media`.`id_media`
JOIN `user` ON `user_has_media`.`id_user` = `user`.`id_user`
WHERE `media`.`id_media` = '1'