app/Libraries/PageHelper.php

SELECT *
FROM `page`
WHERE `id_training` = '10'
---
    function getPageById($id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('page');
        $builder->where("id_training", $id);
        $query = $builder->get();