app/Libraries/PublishHelper.php

SELECT *
FROM `publication`
WHERE `id_publication` = '25'
---
    function getPublisheById($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('publication');
        $builder ->where("id_publication",$id);
        $query   = $builder->get();