app/Libraries/TrainingHelper.php

SELECT *
FROM `training`
WHERE `id_training` = 10
---
    function getTrainingById($id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('training');
        //$builder->select("*");
        $builder->where("id_training", $id);
        $query = $builder->get();

SELECT `id_training`, `title`
FROM `training`
---
    function getTrainingsTitle($status = ALL)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('training');

        $builder->select("id_training, title");
        $query = $builder->get();

SELECT `id_training`, `title`, `date`, `description`, `image_url`
FROM `training`
---
    function getFilterTrainings($status = ALL, $limit = -1)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('training');
        $builder->select("id_training, title,date, description, image_url");
        if ($status != ALL) {
            $builder->where("status", $status);
        }
        if ($limit != -1) {
            $builder->limit($limit);
        }
        $query = $builder->get();