app/Libraries/TrainingHelper.php

    function getFilterTrainings($status=ALL, $limit=-1){
        $db      = \Config\Database::connect();
        $builder = $db->table('training');
        $builder->select("id_training, title, description,image_url");
        if ($status!=ALL){
            $builder->where("status", $status);
        }
        if ($limit!=-1){
            $builder->limit($limit);
        }
        $query = $builder->get();
---
SELECT `id_training`, `title`, `description`, `image_url`
FROM `training`