app/Libraries/UserHelper.php

    function getInfosCertificates($id)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('user');

        $builder->select('certificate.name');
        $builder->where('user.id_user', $id);
        $builder->join('user_has_certificate', 'user_has_certificate.id_user = user.id_user');
        $builder->join('certificate', 'user_has_certificate.id_certificate = certificate.id_certificate');

        $query = $builder->get();
---
SELECT `certificate`.`name`
FROM `user`
JOIN `user_has_certificate` ON `user_has_certificate`.`id_user` = `user`.`id_user`
JOIN `certificate` ON `user_has_certificate`.`id_certificate` = `certificate`.`id_certificate`
WHERE `user`.`id_user` = '37'

    function getInfosCompany($id, $single = true)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('user');
        $builder->select('company.name, company.address,company.city ,company.cp');
        $builder->where('user.id_user', $id);
        $builder->join('user_has_company', 'user_has_company.id_user = user.id_user');
        $builder->join('company', 'user_has_company.id_company=company.id_company');
        $query = $builder->get();
---
SELECT `company`.`name`, `company`.`address`, `company`.`city`, `company`.`cp`
FROM `user`
JOIN `user_has_company` ON `user_has_company`.`id_user` = `user`.`id_user`
JOIN `company` ON `user_has_company`.`id_company`=`company`.`id_company`
WHERE `user`.`id_user` = '37'